___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 04</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Pandas DataFrames</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [DATA FRAMES](#1)
* [CREATING A DATA FRAME](#2)
    * [Creating a DataFrame Using the Lists of Data & Columns](#2.1)
    * [Creating a DataFrame Using a Numpy Arrays](#2.2)
    * [Creating a DataFrame Using a Dictionary](#2.3)
    * [The Examination of Some Attributes on Data](#2.4)
* [INDEXING, SLICING & SELECTION](#3)    
* [CREATING A NEW COLUMN](#4)    
* [REMOVING COLUMNS](#5)
* [REMOVING ROWS](#6)
* [SELECTING ROWS & COLUMNS USING .loc[ ] & .iloc[ ] ](#7)
* [CONDITIONAL SELECTION](#8)
    * [One Conditional Statement](#8.1)
    * [Two or More Conditional Statements](#8.2)
    * [Conditional Selection Using .loc[ ]](#8.3)
* [reset_index() & set_index()](#9)
* [Multi-Index & Index Hierarchy](#10)
* [Some Other Useful Methods with Iris Dataset](#11)
* [THE END OF THE SESSION-04](#12)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy & Pandas you can import them as a library:

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.read_csv("december1_IMDB_top_1000_LV.csv")

,Movie_ID,Title,Certificate,Duration,Genre,Rate,Metascore,Description,Year,Directors,Stars,Votes,Gross($M)
0,1,The Shawshank Redemption,13+,142,Drama,9.3,80,Two imprisoned men bond over a number of years...,1994,Frank Darabont,"Tim Robbins, Morgan Freeman, Bob Gunton, Willi...",2377444,28.34
1,2,The Godfather,16,175,"Crime, Drama",9.2,100,An organized crime dynasty's aging patriarch t...,1972,Francis Ford Coppola,"Marlon Brando, Al Pacino, James Caan, Diane Ke...",1646788,134.97
2,3,The Dark Knight,16,152,"Action, Crime, Drama",9.0,84,When the menace known as the Joker wreaks havo...,2008,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart, M...",2341216,534.86
3,4,The Godfather: Part II,12,202,"Crime, Drama",9.0,90,The early life and career of Vito Corleone in ...,1974,Francis Ford Coppola,"Al Pacino, Robert De Niro, Robert Duvall, Dian...",1146645,57.30
4,5,12 Angry Men,14,96,"Crime, Drama",9.0,96,A jury holdout attempts to prevent a miscarria...,1957,Sidney Lumet,"Henry Fonda, Lee J. Cobb, Martin Balsam, John ...",701877,4.36
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Breakfast at Tiffany's,AL,115,"Comedy, Drama, Romance",7.6,76,A young New York socialite becomes interested ...,1961,Blake Edwards,"Audrey Hepburn, George Peppard, Patricia Neal,...",168708,0.00
996,997,Giant,G,201,"Drama, Western",7.6,84,Sprawling epic covering the life of a Texas ca...,1956,George Stevens,"Elizabeth Taylor, Rock Hudson, James Dean, Car...",34593,0.00
997,998,From Here to Eternity,12,118,"Drama, Romance, War",7.6,85,"In Hawaii in 1941, a private is cruelly punish...",1953,Fred Zinnemann,"Burt Lancaster, Montgomery Clift, Deborah Kerr...",43867,30.50
998,999,Lifeboat,None,97,"Drama, War",7.6,78,Several survivors of a torpedoed merchant ship...,1944,Alfred Hitchcock,"Tallulah Bankhead, John Hodiak, Walter Slezak,...",26791,0.00
999,1000,The 39 Steps,14,86,"Crime, Mystery, Thriller",7.6,93,A man in London tries to help a counter-espion...,1935,Alfred Hitchcock,"Robert Donat, Madeleine Carroll, Lucie Mannhei...",52686,0.00

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Data Frames</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A DataFrame is a two-dimensional data container, similar to a Matrix, but which can contain heterogeneous data, and for which symbolic names may be associated with the rows and columns. ``DataFrames`` are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. 

### Why use Pandas?

Data scientists make use of Pandas in Python for its **following advantages**:

- Easily handles missing data
- It uses Series for one-dimensional data structure and DataFrame for multi-dimensional data structure
- It provides an efficient way to slice the data
- It provides a flexible way to merge, concatenate or reshape the data
- It includes a powerful time series tool to work with

In a nutshell, Pandas is a useful library in data analysis. It can be used to perform data manipulation and analysis. Pandas provide powerful and easy-to-use data structures, as well as the means to quickly perform operations on these structures.

[SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html), 
[SOURCE02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html), 
[SOURCE03](https://morioh.com/p/2528ac775b1b), 
[SOURCE04](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python), 
[SOURCE05](https://www.guru99.com/python-pandas-tutorial.html), 
[SOURCE06](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm), 
[SOURCE07](https://realpython.com/pandas-dataframe/) &
[SOURCE08](https://towardsdatascience.com/a-simple-guide-to-pandas-dataframes-b125f64e1453)<br>
[VIDEO SOURCE01](https://www.youtube.com/watch?v=zmdjNSmRXF4), 
[VIDEO SOURCE02](https://www.youtube.com/watch?v=F6kmIpWWEdU) &
[VIDEO SOURCE03](https://towardsdatascience.com/pandas-dataframe-basics-3c16eb35c4f3)<br>

**Now let's use pandas to explore this topic!**

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a DataFrame</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A **``DataFrame``** is a **two-dimension collection of data**. It is a data structure where data is stored in **tabular form**. Datasets are arranged in rows and columns; we can store multiple datasets in the data frame. We can perform various arithmetic operations, such as adding column/row selection and columns/rows in the data frame.

We can import the DataFrames from the external storage; these storages can be referred to as the SQL Database, CSV file, and an Excel file. We can also use the lists, dictionary, and from a list of dictionary, etc.

In this session, we will learn to create the DataFrame in multiple ways. Let's understand these different ways.

**``pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)``**

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using the Lists of Data & Columns</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [3]:
my_data = [1, 3, 5, 7, 9]
my_data

[1, 3, 5, 7, 9]

In [4]:
# seriye benziyor, ancak data frame daha düzgün ve birden çok seri olabilir
pd.DataFrame(data = my_data)

   0
0  1
1  3
2  5
3  7
4  9

In [5]:
# column için isim verebiliriz
pd.DataFrame(data = my_data, columns = ["column1"])

   column1
0        1
1        3
2        5
3        7
4        9

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Numpy Arrays</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [6]:
my_data = np.arange(1, 24, 2).reshape(3, 4)
my_data

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [7]:
# column sayısı kadar vermeliyiz, hata verir.
pd.DataFrame(data = my_data, columns = ["var1", "var2", "var3", "var4"])

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Dictionary</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [8]:
s1 = np.random.randint(1, 10, size = 4)
s2 = np.random.randint(3, 10, size = 4)
s3 = np.random.randint(4, 15, size = 4)

In [9]:
s1 # gibi

array([3, 8, 5, 6])

In [10]:
# dictionary oluşturalım
myDict = {"var1": s1, "var2": s2, "var3": s3}
myDict

{'var1': array([3, 8, 5, 6]),
 'var2': array([6, 3, 3, 9]),
 'var3': array([ 5,  4, 12,  4])}

In [11]:
# DataFrame oluşturalım
df = pd.DataFrame(myDict)
df

   var1  var2  var3
0     3     6     5
1     8     3     4
2     5     3    12
3     6     9     4

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">The Examination of Some Attributes on Data</p>

<a id="2.4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [12]:
df.head(2)

   var1  var2  var3
0     3     6     5
1     8     3     4

In [13]:
df.tail(2)

   var1  var2  var3
2     5     3    12
3     6     9     4

In [14]:
df.sample(3)

   var1  var2  var3
0     3     6     5
2     5     3    12
3     6     9     4

In [15]:
# column isimlerini getirelim.
# liste içinde getirse de list değil bu, index obj!!!
# ileride çok kullanacağımız için önemli
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [16]:
for i in df.columns:
    print(i)

var1
var2
var3

In [17]:
myDict

{'var1': array([3, 8, 5, 6]),
 'var2': array([6, 3, 3, 9]),
 'var3': array([ 5,  4, 12,  4])}

In [18]:
myDict["var1"]

array([3, 8, 5, 6])

In [19]:
# bunun sonucu Series gelir. df ler serilerden oluşur
df["var1"]

0    3
1    8
2    5
3    6
Name: var1, dtype: int64

In [20]:
type(df["var1"])

pandas.core.series.Series

In [21]:
# serilere uygulanan bütün metodlar df.["columnA"] yapılabilir.
df["var1"].mean()

5.5

In [22]:
for i in df.columns:
    print(df[i].mean())

5.5
5.25
6.25

In [23]:
for i in df.columns:
    print(df[i].min())

3
3
4

In [24]:
# indexleri on the air verir
df.index

RangeIndex(start=0, stop=4, step=1)

In [25]:
# list comprehension yöntemiyle indexleri gösterebiliriz
[i for i in df.index]

[0, 1, 2, 3]

In [26]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [27]:
[i for i in df.columns]

['var1', 'var2', 'var3']

In [28]:
# sütunları yeniden isimlendirerek daha rahat kullanabiliriz
df.columns = "new1", "new2", "new3"
df

   new1  new2  new3
0     3     6     5
1     8     3     4
2     5     3    12
3     6     9     4

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
# index isimleri de değiştirilebilir.
df.index = ["a", "b", "c", "d"]
df

   new1  new2  new3
a     3     6     5
b     8     3     4
c     5     3    12
d     6     9     4

In [31]:
# rename() ile de yapılabilir
df.rename(columns = {"new1": "yeni1", "new2" : "yeni2", "new3": "yeni3"})

   yeni1  yeni2  yeni3
a      3      6      5
b      8      3      4
c      5      3     12
d      6      9      4

In [32]:
# inplace = False default dur, kalıcı olması genellikle işimize yaramaz

In [33]:
# remane () ile istediğimiz sayıda değişiklik yaparız.artısı bu.
df.rename(index = {"a":1, "b":2, "c":3})

   new1  new2  new3
1     3     6     5
2     8     3     4
3     5     3    12
d     6     9     4

In [34]:
# işlemlerin gerçekleştiğini shape() ile görebiliriz
df.shape

(4, 3)

In [35]:
# shape() (a,b) şeklinde tuple gelir. 
# 0,1 index alabiliriz.
df.shape[0] # ile satır
df.shape[1] # ile sütun sayısını bulabiliriz

3

In [36]:
# df uzunluğu satır sayıdır. len ile bulunur
len(df)

4

In [37]:
# kaç boyutlu gösterir.
df.ndim

2

In [38]:
# size boyutu/büyüklüğü verir
df.size

12

In [39]:
df.values

array([[ 3,  6,  5],
       [ 8,  3,  4],
       [ 5,  3, 12],
       [ 6,  9,  4]])

In [40]:
# type Series olur
df["new1"]

a    3
b    8
c    5
d    6
Name: new1, dtype: int64

In [41]:
# serilerde indexleri sorgular,
# df içinde column sorgular
"var1" in df

False

In [43]:
### hata var ###df.var1

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Indexing, Slicing & Selection</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's learn a variety of methods to grab data from a DataFrame

In [44]:
from numpy.random import randn
# rand import ettiğimiz için randn doğrudan kullanabiliriz.

In [45]:
# creating a DataFrame by "keyword arguments"

np.random.seed(101) # seed ile değerleri sabitliyoruz
df = pd.DataFrame(randn(5, 4), index = ['A', 'B', 'C', 'D', 'E'], columns = ['W', 'X', 'Y', 'Z'])
# isimlendirmeyi kendimiz yaparken shape e uygun olmasına dikkat ediyoruz.
# ayrıca list olmasına dikkat ediyoruz.
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
# garanti yöntem
df["Y"]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [47]:
# bu şekilde de çağırabilriz.
# SQL sytax
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [48]:
# seri olarak gelir.
type(df["Y"])

pandas.core.series.Series

In [49]:
# data frame formatında getirmek için ayrıca liste içinde göndermemiz gerek
df[["Y"]]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [50]:
# birden fazla sütun çağırmak/göndermek istiyorsak list içinde göndermek gerek.
# yanlış kullanım df["Y", "Z"]
# doğru kullanım
df[["Y", "Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [51]:
# [] içinde , ile ayrılma işlemi yoksa hepsi row olur
df["X" : "Z"]
# burada hepsi boş gelir

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [52]:
# "Z" diye row yok, onu ignore ediyor
df["A" : "Z"]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df["A" :]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
##### burayı kaçırdım !!!!!!!!

In [55]:
# indexlerken "" kullandığımız için inclusive
df["A":"C"]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [56]:
# sütunları da kısıtlayabiliriz ama columns [] içine almayı unutma
df["A" : "C"][["Y"]]

          Y
A  0.907969
B -0.848077
C  0.528813

In [57]:
df["A" : "C"][["Y","Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001

In [58]:
# [[sütun]] ve [satırları] yer değiştirebiliriz
df[["Y", "Z"]]["A":"C"]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a New Column</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [59]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
# olmayan bir sütun oluşturabiliriz
df["new1"] = df["X"] * df["Y"]
df

          W         X         Y         Z       X*Y      new1
A  2.706850  0.628133  0.907969  0.503826  0.570325  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577  5.156577

In [74]:
# yeni bir column oluşturabiliriz, ancak be careful for row number!!
df["new2"] = np.arange(5)
df

          W         X         Y         Z       X*Y      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577  5.156577     4

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Columns</p>

<a id="5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [75]:
df.drop("new2", axis = 1)

          W         X         Y         Z       X*Y      new1
A  2.706850  0.628133  0.907969  0.503826  0.570325  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577  5.156577

In [76]:
# kalıcı olarak silmez default 
df

          W         X         Y         Z       X*Y      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577  5.156577     4

In [79]:
df.drop(["new1", "new2"], axis = 1)

KeyError: "['new2'] not found in axis"

In [80]:
# kalıcı olarak silmek için inplace = True yapmak gerek.
df.drop("new2", axis = 1, inplace = True)

KeyError: "['new2'] not found in axis"

In [78]:
df

          W         X         Y         Z       X*Y      new1
A  2.706850  0.628133  0.907969  0.503826  0.570325  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577  5.156577

In [68]:
df.drop(["new1", "new2"], axis = 1)

KeyError: "['new2'] not found in axis"

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Rows</p>

<a id="6"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [69]:
# axis = 0 row da işlem yapar. kalıcı değil 
df.drop("C", axis = 0)

          W         X         Y         Z       X*Y
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [70]:
df.drop(index = ["B"])

          W         X         Y         Z       X*Y
A  2.706850  0.628133  0.907969  0.503826  0.570325
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [72]:
# df orijinal kalırken, df_updated ile devam edebiliriz
df_updated = df.drop("C", axis = 0)
df_updated

          W         X         Y         Z       X*Y
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Selecting Rows and Columns using .loc[ ] and iloc[ ]</p>

<a id="7"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

#### `.loc[]` → allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]` → allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [81]:
data = np.random.randint(1, 40, size=(8, 4))

df = pd.DataFrame(data, columns = ["var1", "var2", "var3", 'var4'])
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [82]:
# loc[row, column] label ları girilir
df.loc[4]

var1    20
var2    36
var3    31
var4    11
Name: 4, dtype: int64

In [83]:
# dataframe şeklinde görmek için ayrıca [] kullanırız
df.loc[[4]]

   var1  var2  var3  var4
4    20    36    31    11

In [84]:
# klasik anlamda indexleme değil label alır, inclusive 
df.loc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23

In [85]:
# iloc klasik indexleme yapar
df.iloc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11

In [86]:
"a b c d e f g h".split()

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [88]:
# indexleri değiştirdik.
df.index = "a b c d e f g h".split()
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [89]:
# bildiğimiz indexleme
df.iloc[1:4]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37

In [92]:
df.loc["a":"d"]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37

In [94]:
# loc[row, column] dan sonucu getirir
df.loc["d", "var3"]

25

In [95]:
df.loc["d":"g", "var2"]

d    30
e    36
f    28
g    24
Name: var2, dtype: int64

In [97]:
# bu şekilde de getirebiliriz
df.loc["d":"g"]["var2"]

d    30
e    36
f    28
g    24
Name: var2, dtype: int64

In [99]:
# df şeklinde geitrmek istersek
df.loc["d":"g", ["var2"]]

   var2
d    30
e    36
f    28
g    24

In [98]:
# veya
df.loc["d":"g"][["var2"]]

   var2
d    30
e    36
f    28
g    24

In [100]:
# iloc da hep sayı girmeliyiz
df.iloc[2:5, 2]

c    12
d    25
e    31
Name: var3, dtype: int64

In [101]:
# df olarak görmek istersek
df.iloc[2:5, [2]]

   var3
c    12
d    25
e    31

In [105]:
# df.iloc[2:5][[2]]
# iloc        burda bittiği için df[[2]] bir şey anlamsız olur
# iloc olduğunda label girmek gerek
df.iloc[2:5][["var2"]]

   var2
c    18
d    30
e    36

In [106]:
df.loc["a", "var1"]

8

In [107]:
# data frameo larak getirmek istiyorsak
df.loc[["a"],["var1"]]

   var1
a     8

In [108]:
# [[],] dersek seri verir
df.loc[["a"],"var1"]

a    8
Name: var1, dtype: int64

In [109]:
# fancy indexing
df.loc[["a","c"],["var1", "var3"]]

   var1  var3
a     8    39
c    13    12

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Conditional Selection</p>

<a id="8"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">One Conditional Statement</p>

<a id="8.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [110]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [111]:
# boolen değerler verir
df > 10

    var1   var2   var3   var4
a  False   True   True  False
b   True  False   True  False
c   True   True   True   True
d   True   True   True   True
e   True   True   True   True
f   True   True  False   True
g   True   True   True   True
h  False  False   True   True

In [112]:
# selection ile değerlerin df verir
df[df > 10]
# serilerden farklı olarak False değerlerin yerine NaN getirdi.
# serilerde False değerleri hiç getirmiyordu

   var1  var2  var3  var4
a   NaN  11.0  39.0   NaN
b  19.0   NaN  16.0   NaN
c  13.0  18.0  12.0  16.0
d  34.0  30.0  25.0  37.0
e  20.0  36.0  31.0  11.0
f  21.0  28.0   NaN  23.0
g  27.0  24.0  38.0  23.0
h   NaN   NaN  19.0  29.0

In [113]:
# tek bir sütunda uygulayabiliriz
#seri getirir
df["var1"] > 10

a    False
b     True
c     True
d     True
e     True
f     True
g     True
h    False
Name: var1, dtype: bool

In [114]:
# değerleri almak için
df[df["var1"] > 10]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23

In [116]:
# sadece 1 sütun getirmek istersek
df[df["var1"] > 10][["var2"]]

   var2
b     8
c    18
d    30
e    36
f    28
g    24

In [117]:
# 2 sütun getirmek istersek
df[df["var1"] > 10][["var2", "var3"]]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Two or More Conditional Statements</p>

<a id="8.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**For two or more conditions, you can use | → or, & → and with parenthesis:**

In [118]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [119]:
# var1deki 10dan büyük 20den küçük değerlere göre filtreleme
df[(df["var1"] > 10) & (df["var1"] < 20)]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16

In [120]:
# istediğimiz sütunu getirebiliriz.
df[(df["var1"] > 10) & (df["var1"] < 20)][["var4"]]

   var4
b     1
c    16

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Conditional Selection Using .loc[ ] and .iloc[ ]</p>

<a id="8.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [122]:
# fancy yaparken dikkat []
df.loc[["a","f"]]

   var1  var2  var3  var4
a     8    11    39    10
f    21    28     9    23

In [123]:
df.loc[["a","f"], ["var1", "var4"]]

   var1  var4
a     8    10
f    21    23

In [125]:
# condition uyguluyoruz
df.loc[(df["var1"] > 10), ["var2", "var3"]]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

In [128]:
# birden fazla condition ile yapalım
df.loc[((df["var1"] > 10) | (df["var1"] > 30)), ["var2", "var3"]]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">reset_index() & set_index()</p>

<a id="9"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [129]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [130]:
# indexler label dan oluşyor, 
# onları silmeden en sola index getiriyor
df.reset_index()

  index  var1  var2  var3  var4
0     a     8    11    39    10
1     b    19     8    16     1
2     c    13    18    12    16
3     d    34    30    25    37
4     e    20    36    31    11
5     f    21    28     9    23
6     g    27    24    38    23
7     h    10     3    19    29

In [132]:
# index sütununu drop = True ile değiştirebiliriz.
# inplace = True dersek değişiklik kalıcı olur
df.reset_index(drop = True, inplace = True)

In [ ]:
# atama yaparak kalıcı olmasını sağlayabiliriz.
df = df.reset_index(drop = True)

In [133]:
# column lardan birini index e set edebiliriz.
# inplace = True dersek değişiklik kalıcı olur.
df.set_index("var4", inplace = True)

      var1  var2  var3
var4
10       8    11    39
1       19     8    16
16      13    18    12
37      34    30    25
11      20    36    31
23      21    28     9
23      27    24    38
29      10     3    19

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Multi-Index & Index Hierarchy</p>

<a id="10"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [134]:
# Index Levels

outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [136]:
# multi index oluşturmak için
pd.MultiIndex.from_tuples(multi_index)

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [137]:
hier_index = pd.MultiIndex.from_tuples(multi_index)
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [138]:
np.random.seed(101)
df = pd.DataFrame(np.random.randn(9, 4), index = hier_index, columns=['A', 'B', 'C', 'D'])
df

             A         B         C         D
M1 1  2.706850  0.628133  0.907969  0.503826
   2  0.651118 -0.319318 -0.848077  0.605965
   3 -2.018168  0.740122  0.528813 -0.589001
M2 1  0.188695 -0.758872 -0.933237  0.955057
   2  0.190794  1.978757  2.605967  0.683509
   3  0.302665  1.693723 -1.706086 -1.159119
M3 5 -0.134841  0.390528  0.166905  0.184502
   6  0.807706  0.072960  0.638787  0.329646
   7 -0.497104 -0.754070 -0.943406  0.484752

In [139]:
# indexlerin isimlerini sorgulayalım
df.index.names

FrozenList([None, None])

In [140]:
# isimlendirme yaparbilriz.
df.index.names = ["Group", "Num"]
df.index.names

FrozenList(['Group', 'Num'])

In [141]:
df

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502
      6    0.807706  0.072960  0.638787  0.329646
      7   -0.497104 -0.754070 -0.943406  0.484752

In [142]:
df.index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           names=['Group', 'Num'])

In [143]:
# indexlerin level lerini kontrol edelim
df.index.levels

FrozenList([['M1', 'M2', 'M3'], [1, 2, 3, 5, 6, 7]])

In [144]:
# frozenlist object
# 0 indexi dış indexler
df.index.levels[0]

Index(['M1', 'M2', 'M3'], dtype='object', name='Group')

In [145]:
# 1 indexi iç indexler
df.index.levels[1]

Int64Index([1, 2, 3, 5, 6, 7], dtype='int64', name='Num')

In [146]:
# tüm satırlardaki index value getirir
df.index.get_level_values

<bound method MultiIndex.get_level_values of MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           names=['Group', 'Num'])>

In [147]:
# tüm satırlardaki index value getirir
df.index.get_level_values(0)

Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

In [148]:
# tüm satırlardaki index value getirir
df.index.get_level_values(1)

Int64Index([1, 2, 3, 1, 2, 3, 5, 6, 7], dtype='int64', name='Num')

In [149]:
# index yerine label ismi ile de aynı sonucu alabiliriz
df.index.get_level_values("Group")

Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

In [150]:
# index yerine label ismi ile de aynı sonucu alabiliriz
df.index.get_level_values("Num")

Int64Index([1, 2, 3, 1, 2, 3, 5, 6, 7], dtype='int64', name='Num')

In [151]:
df[["A"]]

                  A
Group Num
M1    1    2.706850
      2    0.651118
      3   -2.018168
M2    1    0.188695
      2    0.190794
      3    0.302665
M3    5   -0.134841
      6    0.807706
      7   -0.497104

In [152]:
df[["A", "B"]]

                  A         B
Group Num
M1    1    2.706850  0.628133
      2    0.651118 -0.319318
      3   -2.018168  0.740122
M2    1    0.188695 -0.758872
      2    0.190794  1.978757
      3    0.302665  1.693723
M3    5   -0.134841  0.390528
      6    0.807706  0.072960
      7   -0.497104 -0.754070

In [153]:
# [] , olmadığı için row indexi verir.
# 3 satıra etki ettiği için 3 satırı getirir.
df.loc["M1"]

            A         B         C         D
Num
1    2.706850  0.628133  0.907969  0.503826
2    0.651118 -0.319318 -0.848077  0.605965
3   -2.018168  0.740122  0.528813 -0.589001

In [155]:
df.loc["M1"].index

Int64Index([1, 2, 3], dtype='int64', name='Num')

In [157]:
# M1 içindeki 2 numaralı satırı getirmek için
df.loc[[("M1",2)]]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965

In [158]:
# [,] , virgül sonrası colums label seçer
df.loc["M1", "A":"C"]

            A         B         C
Num
1    2.706850  0.628133  0.907969
2    0.651118 -0.319318 -0.848077
3   -2.018168  0.740122  0.528813

In [161]:
# M1 deki 2 nolu satırdan değer getirmek için
df.loc[("M1",2), "A":"C"]

A    0.651118
B   -0.319318
C   -0.848077
Name: (M1, 2), dtype: float64

In [162]:
df.loc["M1": "M2"]

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

In [165]:
# iki farklı row seçerken tuple alarak alırız!
df.loc[("M1",2): ("M2",2)]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509

In [167]:
df

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502
      6    0.807706  0.072960  0.638787  0.329646
      7   -0.497104 -0.754070 -0.943406  0.484752

In [166]:
# iki farklı row seçerken
df.loc[("M2",3): ("M3",5)]

                  A         B         C         D
Group Num
M2    3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502

In [168]:
# row yaptık şimdiye kadar, column için [[], []] yaparız
df.loc[[("M2",3), ("M3",5)],["A"]]

                  A
Group Num
M2    3    0.302665
M3    5   -0.134841

**``Note``** that all of the MultiIndex constructors accept a names argument which stores string names for the levels themselves. If no names are provided, None will be assigned:

For more information Indexing and Selecting Data, visit [**Pandas Official Documentation**](https://pandas.pydata.org/pandas-docs/version/0.13.0/indexing.html)

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

More information for Multiindex and Advanced Indexing, visit [**Pandas Official Documentation**](https://pandas.pydata.org/docs/user_guide/advanced.html)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Some Other Useful Methods with Iris Dataset</p>

<a id="11"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

### Let's apply functions/attributes/methods we have learnt for "iris dataset"

In [ ]:
import seaborn as sns

In [ ]:
sns.get_dataset_names()

In [ ]:
df = sns.load_dataset('iris')
df

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of The Session - 04</p>

<a id="12"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

________